{
  "id": 1,
  "created_by": {
    "id": 1,
    "firstname": "NEO",
    "lastname": "MANGANYE",
    "username": null
  },
  "profile": {
    "id": 1,
    "avatarUrl": "avatar.jpg",
    "name": "Neo Manganye",
    "jobTitle": "Senior Content Writer, UX Writer, Social Media Manager",
    "backgroundUrl": "background.jpg",
    "avatar": null,
    "background": null
  },
  "skills": [
    {
      "id": 1,
      "name": "Good writing style that is accurate and adaptable, with an impeccable use of grammar.",
      "strength": 80
    },
    {
      "id": 13,
      "name": "Excellent writing and editing skills including strong attention to detail.",
      "strength": 65
    },
    {
      "id": 12,
      "name": "Excellent written and verbal communication skills and a demonstrable reasoning ability to explain and pitch ideas.",
      "strength": 85
    },
    {
      "id": 2,
      "name": "Ability to perform multiple tasks concurrently while meeting quality objectives.",
      "strength": 85
    },
    {
      "id": 14,
      "name": "Detail orientated and who can quickly learn different industry terminology.",
      "strength": 95
    },
    {
      "id": 10,
      "name": "Strong time management and organizational skills; ability to prioritize and multi-task.",
      "strength": 90
    },
    {
      "id": 3,
      "name": "Strong understanding of professional services marketing.",
      "strength": 80
    },
    {
      "id": 6,
      "name": "Ability to build strong working relationships across all levels of the organization.",
      "strength": 65
    },
    {
      "id": 9,
      "name": "Ability to provide creative direction.",
      "strength": 70
    },
    {
      "id": 15,
      "name": "Ability to work quickly and to agreed daily targets.",
      "strength": 45
    }
  ],
  "about": {
    "id": 1,
    "heading": "Personal Summary",
    "summery": "<p>A dynamic and result-driven communication specialist with a journalism background. I have a knack for writing copy in a variety of formats; social media posts, website copy, emailers, newsletters and press releases. Currently part of a diverse team that is responsible for communicating company key projects and plans to over 55 000 of its internal stakeholders as well as key external stakeholders.</p> <p>I head the Transnet Newsroom, an initiative that I was key in setting up and ensuring that it is operational. Through this platform, my team and I write Transnet positive stories and repurpose this content so it can live on an array of the company’s communication channels such as social media, emailers and on WhatsApp groups. This initiative is crucial as Transnet employees are spread across the country and some do not have access to company emails due to their geographical location – so we keep everyone informed about what is happening in our organisation. </p> <p>I am looking to work in an agile environment that embraces diversity, is customer centric, cares about the environment and is using technology to transform its service offering and the lives of its key stakeholders.</p> <p>When it comes to the company, the main thing is finding a space where I can grow. Specifically, I am looking to grow into a leadership role at some point in my career, so I would love a space that can help with that growth trajectory. Whilst I am open to all industries, I have a keen interest in the Fintech industry.</p>"
  },
  "experience": [
    {
      "id": 5,
      "company": "Transnet SOC Ltd",
      "startdate": "November 2017",
      "enddate": null,
      "position": "Senior Communication Specialist",
      "summery": "Transnet SOC Ltd is the custodian to the country’s freight, rail, pipeline, terminals and ports systems and it operates and maintains in excess of 30 000km of rail infrastructure. My role in the company entails developing and implementing communication strategy which aim to protect and enhance the reputation of the company. These include the drafting of press releases, media relations, media monitoring and stakeholder management. I also had the opportunity to lead the company’s anti-petroleum theft awareness campaign which aimed to bring awareness to Transnet’s key stakeholders about the impact of tampering with the pipeline network and siphoning petroleum products from this infrastructure. The campaign reached over 30 million viewers on various television channels (SABC, eTV and DSTV channels).",
       "roles": [
         "Managing, implementing, monitoring and planning for company’s social media pages (Facebook, Twitter and LinkedIn) which have over 300 000 followers. ",
         "Research, write, edit and interview internal departments to obtain editorial material for Corporate Centre newsletters and e-mailers.",
         "Design creative templates for the company’s newsroom (this initiative aims to communicate the company’s milestones and employee cost cutting innovations).",
         "Media relations (organise interviews for company executives, set-up press briefings and respond to media queries).",
         "Write copy for the company website and intranet.",
         "Write holding statement and press releases.",
         "Oversee alignment of marketing collateral with the Transnet brand identity.",
         "Monitor daily media reports on the company, compile monthly media analysis reports and develop a strategy to mitigate reputation issues emerging from these reports.",
         "Manage and brief service providers timeously to deliver internal content.",
         "Ensure spend is within budget and adheres to Procurement and Public Finance Management Act (PMFA) standards.",
         "Design, manage and distribute promotional and branding collateral to relevant stakeholders.",
         "Mentoring the newly appointed Young Professionals in Training.",
         "Generating the Transnet Customer Newsletter.",
         "Work creatively with our digital marketing team and our development teams to develop layout for various content and communication pieces.",
         "Work with marketing and content team to develop compelling infographics for B2B and B2C technology audiences.",
         "Organize company virtual events."
       ],
       "projects": []
    },
    {
      "id": 6,
      "company": "Transnet SOC Ltd ",
      "startdate": "October 2015",
      "enddate": "November 2017",
      "position": "Communication Specialist",
      "summery": "As a Communication Specialist my role was to generate content for our internal stakeholders and to manage and improve all our communication flows, within and outside of our company.",
      "roles": [
       "Create effective communication strategies for Transnet SOC. Ltd.",
       "Coordinate the company’s Multi-Stakeholder surveys with an intention to learn how our stakeholders perceive our company so that we can implement strategies that can improve our public image.",
       "Manage external and internal communications flow (memos, newsletters etc.).",
       "Design templates of mass media announcement.",
       "Research and write content for the company website, emailers, newsletters and the Transnet One Magazine",
       "Organise company events, seminars and media conferences",
       "Regularly engage with media",
       "Organise and launch Transnet’s flagship projects such as the company’s Supplier Development hubs",
       "Review and edit the Transnet Integrated Report."
      ],
      "projects":[]
    },
    {
      "id": 7,
      "company": "FSP Invest, Fleet Street Publications",
      "startdate": "September 2014",
      "enddate": "August 2015",
      "position": "Managing assistant editor",
      "summery": "FSP Invest, a division of Fleet Street Publications (Pty) Ltd, is a research house and not a registered broker, financial advisor or financial service provider. As a managing assistant editor at FSP Invest, my role involved working closely with the editor-in-chief to research and brainstorm ideas for new articles various publications (Money Club and Fast-track Millionaire.) The bulk of my work involved writing and editing – this opportunity honed my writing skills and ability to pay attention to details.",
      "roles": [
        "Writing marketing copy and business articles for www.moneyclub.co.za.",
        "Writing compelling slider and banner copy for  www.moneyclub.co.za.",
        "Creating and changing popups on www.moneyclub.co.za.",
        "Writing copy for a publication called Fast-track Millionaire.",
        "Tracking traffic on the website and improving copy to attract more people and   increase signups.",
        "Running Facebook campaigns to drive traffic to our websites and eventually generate sales.",
        "Laying out and sending our daily Money Club newsletter to our subscribers.",
        "Using Google Analytics to compile detailed statistics about our website's traffic and traffic sources and measure conversions and sales.",
        "Sending fulfilment emails to our Money Club Book Club subscribers.",
        "Editing copy for different publications (Fast-track Millionaire, Red Hot Penny Shares, Stock of the month and the South African Investor).",
        "Aligning with team members to ensure deadlines are met."
      ],
      "projects": [ ]
    }, {
      "id": 8,
      "company": "Succeed Magazine",
      "startdate": "June 2012",
      "enddate": "July 2014",
      "position": "Journalist",
      "summery": "Succeed Magazine was a publication which offered financial literacy and tips to its audience. My roles included writing articles, regular features and transforming press releases into content for online marketing.",
      "roles": [
        "Writing articles, regular features including events pages, 60 second articles and quick bits.",
        "Writing eBooks and advertorials.",
        "Transforming press releases into content for online marketing.",
        "Conducting telephonic interviews and doing basic research.",
        "Attending exhibitions and selling subscriptions.",
        "Receptionist duties (answering, screening, and forwarding telephone calls)",
        "Greeting walk-in customers and other visitors and escorting them to specific destinations.",
        "Performing administrative support tasks, such as keeping appointment calendar."
      ],
      "projects": []
    }, {
      "id": 9,
      "company": "TUT FM 96.2",
      "startdate": "February 2011",
      "enddate": "April 2012",
      "position": "News reader and presenter",
      "summery": "TUT FM 96.2 is a university campus radio station based in Soshanguve, Gauteng. My role was to Conduct live interviews with experts who can provide additional information or opinions.",
      "roles": [
        "Interpret and present news stories so that viewers or listeners can better understand them.",
        "Conduct live interviews with experts who can provide additional information or opinion.",
        "Investigate stories and compiling news bulletins.",
        "Conducting telephonic interviews and doing basic research.",
        "Reading news and co-hosting."
      ],
      "projects": []
    },
    {
      "id": 9,
      "company": "Tshwane University of Technology",
      "startdate": "Jan 2011",
      "enddate": "Dec 2011",
      "position": "Student Mentor",
      "summery": "Offering Journalism first year students extra lessons on Mass Media.",
      "roles": [
        "Offering Journalism first year students extra lessons on Mass Media."
      ],
      "projects": []
    }
  ],
  "project": [
    {
      "id": 1,
      "projectName": "Bidvest Bank Website",
      "summary": "Consumer facing application built with Angular10",
      "image": "1.jpg",
      "thumb": "thumb_1.jpg",
      "isPdf": false
    },
    {
      "id": 5,
      "projectName": "FOGG Agency - Worksheet",
      "image": "2.jpg",
      "thumb": "thumb_2.jpg",
      "isPdf": false
    },
    {
      "id": 5,
      "projectName": "Fortune Lounge",
      "summary": "",
      "image": "3.jpg",
      "thumb": "thumb_3.jpg",
      "isPdf": false
    },
    {
      "id": 6,
      "projectName": "Fortune Lounge",
      "summary": "",
      "image": "4.pdf",
      "thumb": "thumb_4.jpg",
      "isPdf": true
    },
    {
      "id": 6,
      "projectName": "Fortune Lounge",
      "summary": "",
      "image": "5.pdf",
      "thumb": "thumb_5.jpg",
      "isPdf": true
    },
    {
      "id": 6,
      "projectName": "Fortune Lounge",
      "summary": "",
      "image": "6.pdf",
      "thumb": "thumb_6.jpg",
      "isPdf": true
    }
  ],
  "contact": {
    "id": 1,
    "address": "Johannesburg",
    "phone": "0635011583",
    "email": "tempestmanganye@gmail.com",
    "whatsapp": "https://wa.me/27635011583?text=Hi Neo"
  },
  "social": [
    {
      "id": 10,
      "name": "Twitter",
      "icon": "fa-twitter",
      "url": "https://twitter.com/Tempest_Neo"
    },
    {
      "id": 11,
      "name": "Linked-In",
      "icon": "fa-linkedin",
      "url": "https://www.linkedin.com/in/neo-m-495267133/"
    }
  ],
  "services": [
    {
      "id": 5,
      "icon": "fa-laptop",
      "heading": "UX & Design",
      "summary": "I use innovative digital techniques to deliver cutting-edge design and intelligent user experiences tailored to your audience."
    },
    {
      "id": 6,
      "icon": "fa-code",
      "heading": "Mobile/Web Development",
      "summary": "With more than 5years of experience using cutting edge technology, I continuously create exceptionally innovative and highly engaging web solutions."
    },
    {
      "id": 7,
      "icon": "fa-industry",
      "heading": "Digital Advertising",
      "summary": "I build and manage targeted digital media campaigns, including social media management that improve visibility, drive traffic, and increase return on investment."
    }
  ],
  "education": [
    {
      "institution": "Henley Business School",
      "certification": "Higher Certificate in Management Practice",
      "year": "2021"
    },
    {
      "institution": "University of Cape Town",
      "certification": "Project Management Foundations Short Course",
      "year": "2019"
    },
    {
      "institution": "Tshwane University of Technology",
      "certification": "B-tech Degree in Journalism",
      "year": "2013"
    },
    {
      "institution": "Tshwane University of Technology",
      "certification": "National Diploma in Journalism",
      "year": "2011"
    },
    {
      "institution": "Reitumetse High School",
      "certification": "Matric",
      "year": "2008"
    }
  ]
}
